app/controllers/movie_quotes_controller.rb

  def index
    @movie_quotes = MovieQuote.all
---
SELECT "movie_quotes".* FROM "movie_quotes"

  def insert
    if @movie_quote.nil?
      @movie_quote = MovieQuote.new(movie_quote_params)
      @movie_quote.last_touch = DateTime.now
      @movie_quote.save
---
INSERT INTO "movie_quotes" ("movie", "quote", "last_touch", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["movie", "asd"], ["quote", "asd"], ["last_touch", "2015-06-18 23:11:17.821727"], ["created_at", "2015-06-18 23:11:17.824081"], ["updated_at", "2015-06-18 23:11:17.824081"]]

  def destroy
    @movie_quote.destroy
---
DELETE FROM "movie_quotes" WHERE "movie_quotes"."id" = ?  [["id", 2]]

    def set_movie_quote
      if !params[:id].nil?
        @movie_quote = MovieQuote.find(params[:id])
---
SELECT  "movie_quotes".* FROM "movie_quotes" WHERE "movie_quotes"."id" = ? LIMIT 1  [["id", nil]]